CHT/flow-over-plate/buoyantPimpleFoam-laplacianFoam_extended_fine_fluid/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          401;
        startFace       851062;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          401;
        startFace       851463;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1063;
        startFace       851864;
    }
    slip-bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          801;
        startFace       852927;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          101;
        startFace       853728;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          161;
        startFace       853829;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          852526;
        startFace       853990;
    }
)

// ************************************************************************* //
